In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [29]:
dataset = pd.read_csv(r"titanic.csv") # load dataset -> r- raw string
dataset.head(6) # to show data of 3 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [3]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
# dataset.isnull().sum()

In [6]:
dataset.select_dtypes(include="float64").columns

Index(['Age', 'Fare'], dtype='object')

In [10]:
from sklearn.impute import SimpleImputer

In [13]:
si = SimpleImputer(strategy="mean")
ar= si.fit_transform(dataset[['Age', 'Fare']])

In [16]:
new_dataset=pd.DataFrame(ar,columns=dataset.select_dtypes(include="float64").columns)

In [24]:
new_dataset.isnull().sum()

Age     0
Fare    0
dtype: int64

In [30]:
new_dataset.head (6)

         Age     Fare
0  22.000000   7.2500
1  38.000000  71.2833
2  26.000000   7.9250
3  35.000000  53.1000
4  35.000000   8.0500
5  29.699118   8.4583

In [27]:
dataset['Age'].mean() # mean value

np.float64(29.69911764705882)